Revit 2027 API
AnalyticalToPhysicalAssociationManager.GetAssociatedElementIds Method
 Returns ids of the elements which are in association with the element with the given ElementId.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAssociatedElementIds(
	ElementId elementId
)
Public Function GetAssociatedElementIds (
	elementId As ElementId
) As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAssociatedElementIds(
	ElementId^ elementId
)
member GetAssociatedElementIds :
        elementId : ElementId -> ISet<ElementId>
Parameters
elementId ElementId
 Element id for which we want to get the associated elements.
Return Value
ISet<ElementId>
 Ids of the associated elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace